gemi254/ConfigAssist-ESP32-ESP8266/src/ConfigAssist.cpp
#include <Arduino.h>
#include <vector>
#include <regex>
#include <ArduinoJson.h>
#if defined(ESP32)
  #include <WebServer.h>
  #include "SPIFFS.h"
  #include <ESPmDNS.h>
  #include <SD_MMC.h>
#else
  #include <LittleFS.h>
  #include <ESP8266WiFi.h>
  #include <WiFiClient.h>
  #include <ESP8266WebServer.h>
  #include <ESP8266mDNS.h>
  #include "TZ.h"
#endif  

#define LOGGER_LOG_LEVEL 3    //Set log level for this module
#include "configAssist.h"
#include "configAssistPMem.h" //Memory static valiables (html pages)

#if defined(ESP32)
  #ifdef CA_USE_OTAUPLOAD
      #include "Update.h"
  #endif  
#endif

// Class static members
WEB_SERVER *ConfigAssist::_server = NULL;
String ConfigAssist::_jWifi="[{}]";

#ifdef CA_USE_PERSIST_CON
 Preferences ConfigAssist::_prefs;
#endif


// Standard defaults constructor
ConfigAssist::ConfigAssist() {
  _init = false;
  _jsonLoaded = false; _iniLoaded=false;  
  _dirty = false; _apEnabled=false;
  _confFile = String(CA_DEF_CONF_FILE);
  _jStr = CA_DEFAULT_DICT_JSON;
}

// Standard constructor with ini file
ConfigAssist::ConfigAssist(String ini_file) {
  _init = false;
  _jsonLoaded = false; _iniLoaded=false;  
  _dirty = false; _apEnabled=false;
  
  if (ini_file != "") _confFile = ini_file;
  else _confFile = CA_DEF_CONF_FILE; 

  _jStr = CA_DEFAULT_DICT_JSON;
}
// Standard constructor with ini file and json description
ConfigAssist::ConfigAssist(String ini_file, const char * jStr){
  _init = false;
  _jsonLoaded = false; _iniLoaded=false;  
  _dirty = false; _apEnabled=false;
  
  if (ini_file != "") _confFile = ini_file;
  else _confFile = CA_DEF_CONF_FILE; 
  
  _jStr = jStr;  
}

// delete 
ConfigAssist::~ConfigAssist() {}

// Set ini file at run time
void ConfigAssist::setIniFile(String ini_file){
  if (ini_file != "") _confFile = ini_file;
}
// Set json at run time.. Must called before _init || _jsonLoaded
void ConfigAssist::setJsonDict(const char * jStr, bool load){
  if(_jsonLoaded){
    LOG_E("Configuration already initialized.\n");
    return;
  }
  
  if(jStr==NULL) return;
  _jStr = jStr;
  if(load) loadJsonDict(_jStr);  
}

// Initialize with defaults
void ConfigAssist::init() {
  if(_init) return;
  _init = true;
  loadConfigFile(_confFile);
  //Failed to load ini file
  if(!_iniLoaded){
    _dirty = true;
    loadJsonDict(_jStr, true);
  }
  
  LOG_V("ConfigAssist::init done ini:%i json:%i\n",_iniLoaded, _jsonLoaded);
}
// Is configuration valid
bool ConfigAssist::valid(){ 
  if(!_init) init();
  return (_iniLoaded || _jsonLoaded);
}

bool ConfigAssist::exists(String key){ return getKeyPos(key) >= 0; }            
    
// Start an AP with a web server and render config values loaded from json dictionary
void ConfigAssist::setup(WEB_SERVER &server, bool apEnable ){
  String hostName = getHostName();      
  _server = &server;
  if(apEnable){
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(hostName.c_str(),"",1);
    LOG_I("Wifi AP SSID: %s started, use 'http://%s' to connect\n", WiFi.softAPSSID().c_str(), WiFi.softAPIP().toString().c_str());      
    if (MDNS.begin(hostName.c_str()))  LOG_V("AP MDNS responder Started\n");  
    server.begin();
    _apEnabled = true;
  }
#ifdef CA_USE_WIFISCAN 
  startScanWifi();      
  server.on("/scan", [this] { this->handleWifiScanRequest(); } );
#endif  
  server.on("/cfg",[this] { this->handleFormRequest(this->_server);  } );
  server.on("/upl", [this] { this->sendHtmlUploadPage(); } );
  server.on("/fupl", HTTP_POST,[this](){  },  [this](){this->handleFileUpload(); });
#ifdef CA_USE_OTAUPLOAD  
  server.on("/ota", [this] { this->sendHtmlOtaUploadPage(); } );
#endif
#ifdef CA_USE_FIMRMCHECK  
  server.on("/fwc", [this] { this->sendHtmlFirmwareCheckPage(); } );
#endif
  server.onNotFound([this] { this->handleNotFound(); } );
  LOG_V("ConfigAssist setup AP & handlers done.\n");      
}

// Implement operator [] i.e. val = config['key']    
String ConfigAssist::operator [] (String k) { return get(k); }     
    
// Get a temponary hostname
String ConfigAssist::getMacID(){
  String mac = WiFi.macAddress();
  mac.replace(":","");
  return mac.substring(6);
}

// Get a temponary hostname
String ConfigAssist::getHostName(){
  String hostName = get(CA_HOSTNAME_KEY);
  if(hostName=="") hostName = "configAssist_" + getMacID();
  else hostName.replace("{mac}", getMacID());
  return hostName;
}

// Return the value of a given key, Empty on not found
String ConfigAssist::get(String key) {
  int keyPos = getKeyPos(key);
  if (keyPos >= 0) {
    return _configs[keyPos].value;        
  }
  return String(""); 
}
    
// Update the value of key = value (int)
bool ConfigAssist::put(String key, int val, bool force) {
    return  put(key, String(val), force); 
} 
    
// Update the value of key = value (string)
bool ConfigAssist::put(String key, String val, bool force) {
  int keyPos = getKeyPos(key);      
  if (keyPos >= 0) {
    //Save 0,1 on booleans
    if(_configs[keyPos].type == CHECK_BOX){
      val = String(IS_BOOL_TRUE(val));
    }
    LOG_N("Check : %s, %s\n", _configs[keyPos].value.c_str(), value.c_str());
    if(_configs[keyPos].value != val){
      LOG_D("Put %s=%s\n", key.c_str(), val.c_str()); 
      _configs[keyPos].value = val;
      _dirty = true;
    }
    return true;
  }else if(force) {
      add(key, val);
      sort();
      _dirty = true; 
      return true;
  }else{
    LOG_E("Put failed on Key: %s=%s\n", key.c_str(), val.c_str());
  } 
  LOG_D("Put key %s=%s\n", key.c_str(), val.c_str()); 
  return false;    
}
    
// Add vectors by key (name in confPairs)
void ConfigAssist::add(String key, String val){
  static int readNo = 0;      
  confPairs c = {key, val, "", "", readNo , TEXT_BOX };
  add(c);
  readNo ++;
}

// Add unique name vectors pairs
void ConfigAssist::add(confPairs &c){
  int keyPos = getKeyPos(c.name);
  if(keyPos>=0){
    LOG_E("Add Key: %s already exists\n", c.name.c_str());
    return;
  } 
  LOG_V("Add key [%i]: %s=%s\n", c.readNo, c.name.c_str(), c.value.c_str()); 
  _configs.push_back({c}) ;
}

// Add seperator by key
void ConfigAssist::addSeperator(String key, String val){
  LOG_V("Adding sep key: %s=%s\n", key.c_str(), val.c_str()); 
  _seperators.push_back({key, val}) ;      
}

// Sort vectors by key (name in confPairs)
void ConfigAssist::sort(){
  std::sort(_configs.begin(), _configs.end(), [] (
    const confPairs &a, const confPairs &b) {
    return a.name < b.name;}
  );
}

// Sort seperator vectors by key (name in confSeperators)
void ConfigAssist::sortSeperators(){
  std::sort(_seperators.begin(), _seperators.end(), [] (
    const confSeperators &a, const confSeperators &b) {
    return a.name < b.name;}
  );
}

